{
	"projectplan": {
		"name": "Project Plan",
		"summary": "The project plan outlines the general setup of this project and can be seen as a roadmap that includes all necessary information like project assignment, organisation, scope, planning, practices, approach to research and deliverables. The project plan is eventually used to get approval to start the internship. <br><br> The information in this project plan is based on the assignment description I received from TDE. However, the essential goal and problem statement weren’t yet specified. Therefore, I conducted an additional interview with stakeholder Ruud, my company coach John and client lead Joep from TDE.",
		"imageUrl": "/img/projectplan.png",
		"documentUrl": "https://docs.google.com/document/d/14vrlimfjDGoUlEJZRyYKMt837b_YfnJ_tFa06_uXLDg/edit?usp=sharing",
		"date": "04-09-2023",
		"research": "Deskresearch",
		"phase": "Preperations",
		"learningOutcomes": [1, 2, 3, 4, 5, 6],
		"LearningOutcomeClarification": "For this deliverable I conducted professional duties on a bachelor level in the activity of analysis as I analyzed the project’s goal and problem statement that resulted in this project plan, which is a professional product in line with IT-area user interaction. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> This project plan is relevant and valuable as it’s relevant to myself as it’s valuable to my internship assignment. I also worked in a methodological and structured way in a context where approach and solution area are open. I also worked with multiple stakeholders to create this project plan. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> For the project plan, I explored the organizational context of my project as I identified the business domain and stakeholders for the project. In this project plan, I included research activities time, money, risks and the quality of the solution which is valuable for the organization. Therefore, Learning Outcome 3: Future-Oriented Organization applies. <br><br> In the project plan, I identified problems and opportunities for the client and defined the main scope for the project and formulated related research questions. I also used the interview method to identify the project’s goal and problem statement. Therefore, Learning Outcome 4: Investigative Problem Solving applies. <br><br> In the project plan, I took the lead in my own project planning wise as well as content wise as I made a rough planning for the project and described the content / deliverables of the project. Therefore, Learning Outcome 5: Personal Leadership applies. <br><br> In the project plan, I determined which partners play a role in the project and collaborated with them by doing an interview with the stakeholder to get to know the project’s goal and problem statement, so I communicated appropriately to achieve the desired impact. Therefore, Learning Outcome 6: Targeted Interaction applies.",
		"IctReasearchMethod": {
			"Label": "",
			"Url": false
		},
		"images": [
			{
				"Url": "/img/rn365-placeholder.png",
				"Caption": "RN365"
			},
			{
				"Url": "/img/RuudDimmers.jpeg",
				"Caption": "Ruud Dimmers - CEO RN365"
			},
			{
				"Url": "/img/TDETeam.png",
				"Caption": "Myself, Company Coach John and Client Lead Joep"
			}
		]
	},
	"projectmanagement": {
		"name": "Project Management",
		"summary": "This semester, I used Notion to manage and overview my project and other study related tasks. This is the first time I'm using this tool and I can say that I'm positively surprised about it. I've never kept track of my tasks and deliverables this well in any other semester. This Notion contains scrum boards, notes, links to presentations and deliverables and more and will in the end provide a complete overview of the entire semester.<br><br>Now I’ve discovered the possibilities with Notion, I can manage my project and my semester really well. I’ll continue to use Notion throughout the semester and also use it as a scrum board for the realization phase of my project. This is when I’ll create a backlog with all the parts to realize for my tool and build these parts in an agile way.",
		"imageUrl": "/img/projectmanagement.png",
		"documentUrl": "https://docs.google.com/document/d/1OY3K3e88vu-Tj3cAJa1b1HjgP2O_DJaqmf9vkCDpQKM/edit?usp=sharing",
		"date": "Not applicable",
		"research": "Not applicable",
		"phase": "Entire project",
		"learningOutcomes": [1, 2, 5],
		"LearningOutcomeClarification": "For this deliverable I conducted professional duties on a bachelor level in the activity of manage and control as I used a project management tool and the scrum methodology to manage my project and semester. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> Because I used a project management tool and the scrum methodology, I worked in a methodological and structured way. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> Because I used a project management tool for my planning and content, I took the lead in my own project. Therefore, Learning Outcome 5: Personal Leadership applies.",
		"IctReasearchMethod": {
			"Label": "Available product analysis",
			"Url": false
		},
		"images": [
			{
				"Url": "/img/notion-edited.webp",
				"Caption": "Notion"
			}
		]
	},
	"availableproductanalysis": {
		"name": "Available Product Analysis",
		"summary": "I conducted an available product analysis to find existing solutions on the problem statement for my project. These existing solutions can be used for inspiration in a later stage. I scalped the internet looking for interesting things that have anything to do with data visualization within sports. There are five products or concepts that I found that are interesting. <br><br> First, there’s a concept called digital twins. It is a broad term as it means that a digital twin is a digital version of something physical from the real world. However, it can also be applied to sports. I included this concept as I consider digital twins to be an interesting concept to apply in Formula 1. <br><br> Next, I found Unity’s Metacast. This is a variation of green screen technology, but with multiple cameras to create a 3D model of a moving object, MMA fighters in this example. Metacast provides a high-resolution model that allows for super detailed analysis of the sport. Of course, it’s not possible to wrap an entire Formula 1 track in green screen, but I included it as it might be interesting to use for parts of a race, like analyzing pitstops etc. <br><br> The videos of Formula Addict on YouTube are a great example of how 3D visualizations can be implemented in F1. This also allows for a more detailed analysis by fans. However, these videos are made after the event. I included this example because I am curious to see if it’s possible to automate this process or even present it live for the users. <br><br> F1TV Pro’s 2D visualization of track positions are a great example of data visualization within Formula 1. I included this example because I’m curious if a 3D variant of this product would add value for F1 fans. <br><br> At last, I included a little project called F1 Race Visualizer, this tool is built on the Ergast API that serves historical Formula 1 data. I included this tool as I found it interesting as it uses historical data instead of live-timing data, and I’m curious if historical data could also play a role in my project. <br><br> These five examples will be presented during the focus group discussion where we’re going to ideate the first idea’s as these examples will be a great source of inspiration during the brainstorming session.",
		"imageUrl": "/img/availableproductanalysis.png",
		"documentUrl": "https://docs.google.com/document/d/1Nwsh0zmCA8MmwlRhelnxVwMvQLGoVpiMI8Gd5Q1HLuw/edit?usp=sharing",
		"date": "05-09-2023",
		"research": "Library Research",
		"phase": "Orientation and Concepting",
		"learningOutcomes": [1, 2, 4],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activity of Analysis as I analyzed for interesting existing products to gain inspiration from for my project. This is in line with IT-area User Interaction. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> This deliverable is relevant and valuable as it plays a role in the orientation phase of the project and will provide an input for the focus group discussion later in the project. I also worked in a methodological and structured way as an available product analysis is a proven research methodology. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> This deliverable is a research method on ictresearchmethods.nl. and it is an effective approach to find valuable insights for the orientation phase. Therefore, Learning Outcome 4: Investigative Problem Solving applies.",
		"IctReasearchMethod": {
			"Label": "Available product analysis",
			"Url": "https://ictresearchmethods.nl/library/available-product-analysis/"
		},
		"images": [
			{
				"Url": "/img/unitymetacast.png",
				"Caption": "Unity Metacast"
			},
			{
				"Url": "/img/formulaaddict.png",
				"Caption": "Formula Addict lap comparison - YouTube"
			},
			{
				"Url": "/img/f1tvpro.png",
				"Caption": "Current F1TV Pro data visualization"
			},
			{
				"Url": "/img/f1racevisualizer.png",
				"Caption": "F1 Race Visualizer build with Ergast API"
			},
			{
				"Url": "/img/digitaltwin.png",
				"Caption": "Google Maps AR makes a digital twin of the real world in your phone"
			}
		]
	},
	"availabledataanalysis": {
		"name": "Available Data Analysis",
		"summary": "One of this project's research questions asks what data is available from an F1 race. The answer for this question is required for the Double Diamond's ideation phase, where a solution for the problem statement will be defined. <br><br> This question will primarily be answered using library research. However, RacingNews already makes use of an API for Formula 1 data. This API is undocumented however, and not much can be found online about it. So information about this API will have to come from TDE itself.<br><br> Also, in this research, I'm also looking for data that could be interesting to visualize with ThreeJS. Think of GPS data of Formula 1 cars for example.<br><br> It seems like two types of data can be used for this project: live data and historical data. Further research will tell what data will eventually be used. However, it's good to know what data is available to get a better understanding of what's possible to build.<br><br> All three data sources found are interesting, although Fast-F1 is the most reliable data source, it cannot be used in the project, as it isn’t suitable for web applications. Ergast is unsuitable to use as well as it will probably shut down next year. This will result in an unsustainable product. The undocumented API is also risky to use as we don’t know what will happen with this data source in the future. However, this is the most promising data source for the project, as RN365 already uses this data source for their live timing data, and this data source also provides positioning data of Formula 1 cars.",
		"imageUrl": "/img/availabledataanalysis.png",
		"documentUrl": "https://docs.google.com/document/d/1RdJ-HJGdh8pljJCTHmVwz5RTRG9IG7DuPhvGCP4Rxrw/edit?usp=sharing",
		"date": "18-09-2023",
		"research": "Library Research",
		"phase": "Orientation and Concepting",
		"learningOutcomes": [1, 2, 3, 4],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activities of Analysis and Advise as I analyzed for available data sources and advised on the use of these data sources in the project. This is in line with IT-area User Interaction. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> This deliverable is relevant and valuable as it plays a role in the orientation phase of the project and the results will have an impact on the concept that’s being formed in the concepting phase. I also worked in a methodological and structured way. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> In my advice for the best data source to use, I took sustainable development into consideration, as one of the data sources found will result in an unsustainable product when used. I included this in my advice for the data source to use in my project. Therefore, Learning Outcome 3: Future-Oriented Organization applies. <br><br> This deliverable is a research method on ictresearchmethods.nl. and it is an effective approach to find out what data sources are available for my project. I also identified problems with the data sources found and used the results from this research as an input for the focus group discussion. Therefore, Learning Outcome 4: Investigative Problem Solving applies.",
		"IctReasearchMethod": {
			"Label": "Data analytics",
			"Url": "https://ictresearchmethods.nl/lab/data-analytics/"
		},
		"images": false
	},
	"fanengagementstrategies": {
		"name": "Fan Engagement Strategies",
		"summary": "During my search for 3D applications within sports, I found that this topic contracts with so-called fan engagement strategies. This topic falls in line with the general goal of this project, namely improving the F1 experience for viewers at home by creating more engagement. <br><br> According to BILUe, fan engagement in sports is an act of providing an end-to-end experience for a sports audience. This starts before a match, during a match and after a match. The ultimate goal is to have a more personal connection with the sport or brand. <br><br> This document provides a summary of a few findings that were found online. In the end it is concluded how this information can be useful for this project. <br><br> It turns out that fan engagement strategies can elevate the engagement between sports and fans. What’s interesting to take from these strategies is that it’s important to look for things like uniqueness, interaction and more options for analysis, as these things result into more engagement with sports fans.",
		"imageUrl": "/img/fanengagementstrategies.png",
		"documentUrl": "https://docs.google.com/document/d/1W-NzbCbUIzgo9ZKQvKMegBAlIOj03Av7L932cknQ2ec/edit?usp=sharing",
		"date": "18-09-2023",
		"research": "Library Research",
		"phase": "Orientation and Concepting",
		"learningOutcomes": [1, 2, 4],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activities of Analysis and Advise as I analysed the concept of fan engagement strategies and advised on the use of fan engagement strategies in the project. This is in line with IT-area User Interaction. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> This deliverable is relevant and valuable as it plays a role in the orientation phase of the project. I also worked in a methodological and structured way. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> I discovered that the use of fan engagement strategies is an opportunity for the client. This deliverable is a research method on ictresearchmethods.nl. and it is an effective approach to find valuable insights for the orientation phase.  I evaluated my findings by presenting them during the focusgroup discussion and asked for feedback on my research. Therefore, Learning Outcome 4: Investigative Problem Solving applies.",
		"IctReasearchMethod": {
			"Label": "Literature study",
			"Url": "https://ictresearchmethods.nl/library/literature-study/"
		},
		"images": false
	},
	"availalbetechnologiesanalysis": {
		"name": "Available Technologies Analysis",
		"summary": "This project will involve multiple technologies that are new to me and some of them contain quite a steep learning curve. ThreeJS is probably the largest one. Fortunately, TDE has a course available that consists of about 80 hours of material. Next I'll write small summaries of technologies that I found during my research. In the end I'll conclude how these technologies could be useful for the project. <br><br> During my own TheeJS journey, I've heard multiple times that the possibilities are limitless. This of course doesn't mean much, but I found that TheeJS is quite capable. It's possible to visualize as much detail as you want, as long as the hardware is powerful enough. ThreeJS feels a bit like Unity3D but scaled down to fit in a web package. Therefore, it's certainly possible to build entire games with it, or make highly realistic digital twins of real-world items or environments. ThreeJS also supports physics, which allows for running simulations and more. <br><br> Next, there's React-three-fiber which is a front-end framework built to make integrating ThreeJS in React or Next much easier. <br><br> At last, Yuka is a library that might be really interesting for the general goal of this project; to visualize Formula 1 data in 3D. Yuka enables you to simulate vehicle behavior in a 3D web environment. This means it's also possible to simulate entire F1 races in 3D, based on timing data. <br><br>",
		"imageUrl": "/img/availabletechnologiesanalysis.png",
		"documentUrl": "https://docs.google.com/document/d/1sS0wi5vEQY9FZUw1GvNjbl8w6A75Dsrg3gICDaD33IU/edit?usp=sharing",
		"date": "08-09-2023",
		"research": "Library Research",
		"phase": "Orientation and Concepting",
		"learningOutcomes": [1, 2, 4],
		"LearningOutcomeClarification": "This deliverable is a professional product on a bachelor level in the activities of Analysis and Advise as I analysed for technologies useful for my project and advised on the use of the found technologies. This is in line with IT-area User Interaction. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> This deliverable is relevant and valuable as it plays a role in the orientation phase of the project. I also worked in a methodological and structured way. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> This deliverable is a research method on ictresearchmethods.nl. and it is an effective approach to find valuable insights for the orientation phase.  I evaluated my findings by presenting them during the focusgroup discussion and asked for feedback on my research. Therefore, Learning Outcome 4: Investigative Problem Solving applies.",
		"IctReasearchMethod": {
			"Label": "Literature study",
			"Url": "https://ictresearchmethods.nl/library/literature-study/"
		},
		"images": [
			{
				"Url": "/img/tdeblender.png",
				"Caption": "The TDE logo, transformed from an .svg to a 3D model in Blender3D"
			},
			{
				"Url": "/img/tdethreejs.png",
				"Caption": "The TDE logo as a 3D model imported in ThreeJS"
			},
			{
				"Url": "/img/yukajs.png",
				"Caption": "Simulating driving behaviour with YukaJS"
			}
		]
	},
	"onlinesurvey": {
		"name": "Online Survey",
		"summary": "I released a survey with the goal to identify target audience interests and preferences. In earlier conducted research, I found that this project can play a role in a historical context or a live context, I want to know what the user finds more important for example. Other things that I would like to know are current viewing habits, preferences about data visualization, possibilities of interactivity, potential additional features and what type of monetization to use. <br><br> The survey was completed by colleagues of TDE and participants of a WhatsApp group about Formula 1. In total, there are 32 replies. <br><br> We now know that the 3D visualization tool will be a secondary source of information for people who follow Formula 1 and that users are primarily watching TV to follow an F1 race. Also, people don't make much use of second screens during a live race while they're watching the TV. This means that users have their mobile phones available for potential 3D visualizations. Next, users replay a race quite often. Which makes making 3D visualizations during a replay an option to consider. <br><br> Users find historical data more interesting than live timing data. But there's not much difference. Making a tool for comparing live timing data with historical data is considered to be not that interesting, but it might be interesting to add at a later stage. In addition, the tool will provide the ability to control the 3D visualizations with zoom, rotation etc and people have relatively fast internet, so we don't have to be extremely careful with larger 3D models. Gamification will not be important for the project, however it might be interesting for further development at a later stage and users prefer a freemium model as a payment method.",
		"imageUrl": "/img/onlinesurvey.png",
		"documentUrl": "https://docs.google.com/document/d/1sQPTd4AKi0mAlvhJC4RewRhu6ZAmvQ0Nxg_iAeNZlqI/edit?usp=sharing",
		"date": "25-09-2023",
		"research": "Field Research",
		"phase": "Orientation and Concepting",
		"learningOutcomes": [1, 2, 4, 6],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activities of Analysis and Advise as I analyzed the interests and values of the target audience and advised on how these interests and values are important for the concept. This is in line with IT-area User Interaction. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> This deliverable is relevant and valuable as it has a contribution to the ideation of the concept. I also worked in a methodological and structured way. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> This deliverable is a research method on ictresearchmethods.nl. I used the results from this research as an input for the focus group discussion. Therefore, Learning Outcome 4: Investigative Problem Solving applies. <br><br> This survey was sent to colleagues and Formula 1 enthusiasts, so I communicated appropriately to make sure the survey would be completed by the right audience and achieved the desired impact. Therefore, Learning Outcome 6: Targeted Interaction applies.",
		"IctReasearchMethod": {
			"Label": "Survey",
			"Url": "https://ictresearchmethods.nl/field/survey/"
		},
		"images": false
	},
	"targetaudienceanalysis": {
		"name": "Target Audience Analysis",
		"summary": "RacingNews has a general target audience based on the visitors of their websites. In this document I'll take a look at the analytics of these websites and make a conclusion on what's interesting to include in the project. Later these conclusions will be an input for personas, empathy maps and customer journeys in the user-centered-design analysis. <br><br> Based on the data provided by Google Analytics, the target audience for RacingNews is 35 years or older, with the biggest audience at 65+. The target audience uses the website most often during or after a racing weekend and primarily uses smartphones to access the website. Google Chrome and Safari are the two most popular web browsers.",
		"imageUrl": "/img/targetaudienceanalysis.png",
		"documentUrl": "https://docs.google.com/document/d/14PeIeQcrhOACbNm3CaA-IeQcVOfDhON0ACb4aLf95cE/edit?usp=sharing",
		"date": "27-09-2023",
		"research": "Lab Research",
		"phase": "Orientation and Concepting",
		"learningOutcomes": [1, 2, 4],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activities of Analysis and Advise as I analysed the analytics of RN365 and advised on findings that could have an impact on the project. This is in line with IT-area User Interaction. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> This deliverable is relevant and valuable as it plays a role in the orientation phase of the project. I also worked in a methodological and structured way and adapted to the processes and way of thinking of TDE, as TDE uses Google Analytics for analysis on their digital products. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> This deliverable is a research method on ictresearchmethods.nl. and it is an effective approach to find valuable insights for the orientation phase. I used the results from this research as an input for the focusgroup discussion. Therefore, Learning Outcome 4: Investigative Problem Solving applies.",
		"IctReasearchMethod": {
			"Label": "Data analytics",
			"Url": "https://ictresearchmethods.nl/lab/data-analytics/"
		},
		"images": false
	},
	"focusgroupdiscussion": {
		"name": "Focusgroup Discussion",
		"summary": "The insights discovered in the orientation phase will come together in a Focus Group Discussion where me with a few colleagues and Ruud from RN365 will brainstorm for an idea to further develop into a concept. One hour is reserved in everyone’s calendar, so it’s up to me to make this time as valuable as possible. <br><br> Therefore, I prepared a slideshow to give structure to the discussion and made sure I got what I needed. The result is a general idea of what the end product will look like. <br><br> As for now, the idea looks like this: users need a good overview of a race. If a user misses two laps of a race, and the entire driver standing changed, the user wants to know what happened. We want to solve this by making a timeline that automatically logs events like overtakes, safety cars etc. It's possible to filter by driver to personalize the timeline and keep it uncluttered. Each event has its own replay button that visualizes an overtake in 3D for example. This automated timeline can easily be integrated with the liveblog of RN365. This can be done in two ways; Liveblog items written by the RN365 editorial could be included in the timeline, but automated events can also play a role in the RN365 liveblog as a semi-automated function that fills the liveblog.",
		"imageUrl": "/img/focusgroupdiscussion.png",
		"documentUrl": "https://docs.google.com/document/d/1lskWLjGzf1BScHdkpHAlmjouDJ852ZLqUhnAk5XXh8I/edit?usp=sharing",
		"date": "6-10-2023",
		"research": "Field Research",
		"phase": "Orientation and Concepting",
		"learningOutcomes": [1, 2, 3, 4, 5, 6],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activities of Analysis Advise and Realise as a focus group applies for the analysis phase of the project. The results of the focus group formed an advice for the concept and the brainstorm session in the focus group discussion realised an idea to develop into a concept. This is in line with IT-area User Interaction. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> This deliverable is relevant and valuable as it plays a role in the concepting phase of the project. I also worked in a methodological and structured way and adapted to the processes and way of thinking of TDE, as I explained that TDE doesn’t use brainstorming methods and prefers to just converse to find solutions. This also happened besides the brainstorm method during the discussion and this general conversation gave more shape to the idea than the brainstorm method. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> During the formation of the idea, we took sustainable development into account. We agreed not to use the Ergast API, as it would result in a product that’s not sustainable because Ergast will shut down next year. Also, we took business into consideration. As the tool will be part of RN365’s premium subscription model. Therefore,  Learning Outcome 3: Future-Oriented Organisation applies. <br><br> This deliverable is a research method on ictresearchmethods.nl. and it is an effective approach to come up with an idea to further develop into a concept. The idea that resulted from the focus group discussion was validated by strategy expert Michiel and the entire concept was later validated by stakeholder Ruud. Therefore, Learning Outcome 4: Investigative Problem Solving applies. <br><br> I acknowledged that the time for this focus group would be really valuable and to make sure that I got what I needed, I took the lead in this meeting and gave structure by making sure everyone knew the objective, and explained that in the end, I would need an idea to further develop into a concept. Therefore, Learning Outcome 5: Personal Leadership applies <br><br> This meeting was attended by several partners that have a role in my project. I communicated appropriately to make sure the focus group had the right impact and execution. Therefore, Learning Outcome 6: Targeted Interaction applies.",
		"IctReasearchMethod": {
			"Label": "Focus group",
			"Url": "https://ictresearchmethods.nl/field/focus-group/"
		},
		"images": false
	},
	"feasibilitystudy": {
		"name": "Feasibility Study",
		"summary": "There are two important things that need to be tested in order to be sure that the end product can be realized. We know that most users will use the tool on their phone, so first I need to be sure that mobile devices are powerful enough to handle a ThreeJS scene. <br><br> Next, I must confirm that network and server performance won’t be an issue. Therefore, I must calculate how much bandwidth the server needs to be able to handle. <br><br> The ThreeJS performance test, didn’t only conclude that ThreeJS is up for the job to simulate an entire F1 race. But I also established criteria for a smooth experience. I now know that at least 30 FPS are needed for a smooth experience, and that a medium spec smartphone can handle around 7500 moving objects before the framerate drops below 30 FPS. This is way more than the 20 moving cars driving around a Formula 1 track. <br><br> I also calculated a worst-case amount of data that needs to be processed by the server. Jordi, an expert on software architecture and hosting confirmed that it’s possible, but some additional research might be necessary. How the software architecture will look will be discussed in an interview with Jordi.",
		"imageUrl": "/img/feasibilitystudy.png",
		"documentUrl": "https://docs.google.com/document/d/1A9j0_J2GC2j20YNg2MqrtyU-MHxKopjCPZ3CW0f4a_M/edit?usp=sharing",
		"date": "2-10-2023",
		"research": "Lab Research",
		"phase": "Orientation and Concepting",
		"learningOutcomes": [1, 2, 3, 4],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activities of Analysis and Advise as I analysed the performance of ThreeJS and advised for the use of a criteria for establishing a smooth experience with ThreeJS. I also analysed if the large amounts of data that need to be handled by the server could be a problem and advised that this won’t be a problem, but further research is necessary. This is in line with IT-area User Interaction. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> This deliverable is relevant and valuable as it plays a role in the concepting phase of the project. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> This deliverable is an effective approach to validate if the concept can actually be realised. Therefore, Learning Outcome 4: Investigative Problem Solving applies. <br><br> I identified potential problems and found an effective approach to find an answer to my question. Therefore, Learning Outcome 4: Investigative Problem Solving applies.",
		"IctReasearchMethod": {
			"Label": "System test",
			"Url": "https://ictresearchmethods.nl/lab/system-test/"
		},
		"images": false
	},
	"conceptvalidation": {
		"name": "Concept Validation",
		"summary": "The idea that originated in the focusgroup discussion needs to be validated and adjusted where necessary. I used several research methods to accomplish this.<br><br> First, I conducted an expert interview with an expert on strategy and concepting. This expert was very pleased about the combination of an eventfeed with a visual representation in a Formula 1 race and he didn’t have any remarks on the concept itself. However, he indicated that it’s important that the visuals are accurate. If they aren’t accurate enough, it makes more sense to make a 2D variant instead. I also have to start early with the implementation of the corporate branding in the design to avoid having to make last minute changes in the layout of the tool.<br><br> Next, I realized an iteration on the layout by making some early wireframes. I tested these wireframes in combination with some interview questions about the idea and concluded that the concept works, but the layout needs some adjustments. Therefore, I added a clear-all-filters button to quickly get rid of all filters. I also wasn’t sure if a horizontal or a vertical eventfeed would work best, so I made a new version to test both. Turns out a vertical eventfeed works best and it needs to be sorted by newest item first.<br><br> Later, I validated the concept with two interviews with RN365. One with Ruud and Jan, and an additional interview with Jan only. These interviews made quite a few changes to the concept. First, the eventfeed is going to replace the current liveblog completely. Also, the liveblog will be semi-automated instead of fully automated, as RN365 indicated that they want to have control over the items sent to the liveblog to maybe change the tone of voice etc. This requires additional research and concepting on the CMS for RN365. Also the 3D visualization will be changed. It’s too risky to use position data of the cars as it will be too obvious that we’re using data from the FIA API. This will be replaced by a feature where events will be positioned as pins on the track, as we could easily argue that this position was entered manually in the case FIA starts asking questions about our data source.",
		"imageUrl": "/img/conceptvalidation.png",
		"documentUrl": "https://docs.google.com/document/d/16Gq-uPaawIx54JfEQ8A9LcfFCn3mJQo_fjLU4ffubNw/edit?usp=sharing",
		"date": "18-10-2023",
		"research": "Field / Lab / Workshop Research",
		"phase": "Orientation and Concepting",
		"learningOutcomes": [1, 2, 4, 5, 6],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activities of Analysis, Advice, Design and Realize as I analyzed for improvements on the concept, advised on improvements and adjustments to be made and I designed and realized a functional rapid prototype which is a professional product that is in line with the IT-area User Interaction. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> This deliverable is relevant and valuable as it resulted in valuable improvements on the concept. Therefore, Learning Outcome 2: Situation-Orientation applies.<br><br> This deliverable is an effective approach to improve and validate the concept. I used a variety of research strategies, methods and activities to find justified answers to my questions. Therefore, Learning Outcome 4: Investigative Problem Solving applies.<br><br> I took the lead in my project for this deliverable as I independently planned meetings with the stakeholder. Therefore, Learning Outcome 5: Personal Leadership applies.<br><br> My communication has the right impact and execution as I communicated appropriately with the strategy and concepting expert, test candidates and stakeholder. Therefore, Learning Outcome 6: Targeted Interaction applies.",
		"IctReasearchMethod": {
			"Label": "Prototyping",
			"Url": "https://ictresearchmethods.nl/workshop/prototyping/"
		},
		"images": false
	},
	"rn365visualaudit": {
		"name": "RacingNews365 Visual Audit",
		"summary": "In the UI Design phase, RN365’s corporate branding will be applied to the wireframes from the concepting phase. I asked a designer at TDE if there’s a brand guide or style guide for RN365 that contains information about the corporate branding. This isn’t the case. Therefore, he suggested just taking over the styling as it is in the website. I did this in a so-called visual audit, where I focussed on a few key points like colors, fonts, imagery and icons, navigation and button behavior. <br><br> I put all my findings in a document and made my own simplified style guide. I used this as a reference when applying the corporate branding to the prototype.",
		"imageUrl": "/img/rn365visualaudit.png",
		"documentUrl": "https://docs.google.com/document/d/1QR4vpY0wT8XaFscTgx33tKisEtMGr_uIpTgS2l_vxs4/edit?usp=sharing",
		"date": "19-10-2023",
		"research": "Field Research",
		"phase": "UI Design",
		"learningOutcomes": [1, 2, 4, 6],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activities of Analysis, Design and Realize as I analyzed the corporate branding of RN365 and designed and realized a high fidelity prototype based on the analysis. This deliverable is a professional product that is in line with the IT-area User Interaction. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> I adapted to the processes and way of thinking of TDE as TDE doesn’t have a styleguide of RN365 and makes new designs for RN365 based on the website itself. Just as I did in this deliverable. My work is also relevant and valuable as I created value as a style guide for the making of the high fidelity prototype. I also worked in a methodological and structured way. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> I identified a problem, which is a missing style guide of RN365 to use for the making of my high fidelity prototype and found an effective approach to arrive at the appropriate solution to do a visual audit of RN365’s website and make my own temporary style guide that I could use for my prototype. Therefore, Learning Outcome 4: Investigative Problem Solving applies. <br><br> I communicated appropriately with a designer at TDE to find out RN365 doesn’t have a style guide. Therefore, Learning Outcome 6: Targeted Interaction applies.",
		"IctReasearchMethod": {
			"Label": "Prototyping",
			"Url": false
		},
		"images": [
			{
				"Url": "/img/hifiprototype.png",
				"Caption": "High Fidelity prototype with the corporate branding applied."
			}
		]
	},
	"designvalidation": {
		"name": "Design Validation",
		"summary": "The corporate branding is now applied to the wireframes, but to be sure the combination of the corporate branding and the wireframes works for the users, the design is validated. This is done with a Heuristic Evaluation, where the design is checked on the 10 usability heuristics defined by Jacob Nielsen. This is a quick and low effort test to check if I made any critical errors in the design. Later, I tested the design with a few employees at RN365. I considered these candidates perfect for testing as they don’t yet know of my project and match the target audience of RN365. <br><br> The design of the tool passes the 10 heuristics of the heuristic evaluation, so this didn’t result in any improvements to the design. Later when the design was tested with users, I discovered a small error in the lap count visualization and the track status indicator and made improvements on the design to prevent these errors for the user. I also got some valuable feedback on the concept from the test candidates and I received a list with words users look for when searching for a Formula 1 liveblog on Google. These words can be implemented in the tool to improve SEO.",
		"imageUrl": "/img/designvalidation.png",
		"documentUrl": "https://docs.google.com/document/d/1_t3RxpnSGRNIh0BmKXQfTD9XFBTt0nulYnk9rVIBp3U/edit?usp=sharing",
		"date": "30-10-2023",
		"research": "Lab Research",
		"phase": "UI Design",
		"learningOutcomes": [1, 2, 4, 6],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activities of Analysis, Design and Realise, as I analyzed for errors in the design and designed and realized improvements for the high fidelity prototype. This is a professional product that is in line with the IT-area User Interaction. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> This deliverable is relevant and valuable as it resulted in valuable improvements on the design. I also worked in a methodological and structured way. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> This deliverable is an effective approach to improve and validate the design. I used a variety of research strategies, methods and activities to find problems with the prototype and came to solutions that were later validated with the relevant stakeholder. Therefore, Learning Outcome 4: Investigative Problem Solving applies. <br><br> I took the lead in my project for this deliverable as I independently planned meetings with employees of RN365 and executed the user tests. Therefore, Learning Outcome 5: Personal Leadership applies. <br><br> My communication has the right impact and execution as I communicated appropriately with RN365 and the test candidates. Therefore, Learning Outcome 6: Targeted Interaction applies.",
		"IctReasearchMethod": {
			"Label": "Usability testing",
			"Url": "https://ictresearchmethods.nl/lab/usability-testing/"
		},
		"images": [
			{
				"Url": "/img/designvalidationImprovements.png",
				"Caption": "Improvements to the track status indicator."
			}
		]
	},
	"developmentapi": {
		"name": "Development API",
		"summary": "The tool I’m building is using live data from a Formula 1 race. These races only happen on the weekend and the last race of this season is in the last weekend of November already. For the sake of convenience, it’s important to be able to develop and test the tool whenever I want. Therefore, I built a development API. This API is able to process the positioning data from the Formula 1 static API from every race and all the raw data from the live API from the 2023 Vegas GP. The data from this race will be sufficient to build the tool, but to test the tool for other races, the API will have to be elaborated upon in order to process all the data from other races.",
		"imageUrl": "/img/developmentapi.png",
		"documentUrl": "https://docs.google.com/document/d/13UhSOyT-zhnJX8PE8_56Q33RX7rne5E9j1kM8uQMpic/edit?usp=sharing",
		"date": "31-10-2023",
		"research": "Not applicable",
		"phase": "Development",
		"learningOutcomes": [1, 2, 4],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activities of Realize and Advise as I realized a development API to use during development and advised on future elaborations of the API. Therefore, Learning Outcome 1: Professional Duties applies <br><br> This deliverable is relevant for one or more persons and creates value as this API is necessary to test and build the tool I’m going to make. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> I identified a problem, which is the inability to develop and test when live data is not available. I found an effective approach and arrived at appropriate solutions by making a development API so I can test and build whenever I want. Therefore, Learning Outcome 4: Investigative Problem Solving applies",
		"IctReasearchMethod": {
			"Label": "Usability testing",
			"Url": "https://ictresearchmethods.nl/lab/usability-testing/"
		},
		"images": false
	},
	"realtimecommunicationmethods": {
		"name": "Realtime Communication Methods",
		"summary": "Data needs to be processed by a server before it gets sent to the client. There are multiple real time communication methods to do this. Therefore, I need to know which one works best for the tool I’m going to make. <br><br> I conducted an expert interview with John to determine which methods to compare to find the best option. With this information, I conducted library research online to find pros and cons for each method and concluded which one is the best to implement in my tool. <br><br> I found that Server Send Events (SSE) works best as SSE is fast and easy to implement. It also allows only one-way traffic. This works for my tool as the clients don’t have to send any information back to the server.",
		"imageUrl": "/img/realtimecommunicationmethods.png",
		"documentUrl": "https://docs.google.com/document/d/1L1umNYMEO2oX1zMa7jFsIxtP7aVyqYThFIpRibqKM_0/edit?usp=sharing",
		"date": "01-11-2023",
		"research": "Library Research",
		"phase": "Development",
		"learningOutcomes": [1, 2, 4, 6],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activities of Analysis and Advise as I analyzed what the best possible real-time communication method is and advised which one to use in my project. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> This deliverable is relevant for one or more persons and creates value as it’s important that the correct communication method is used to get data from the server to the client. I also worked in a methodological and structured way as I first interviewed an expert to determine which options to further investigate and later compared these options to come to a dependable solution. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> I used a variety of research strategies, methods and activities to come to my conclusion. Therefore, Learning Outcome 4: Investigative Problem Solving applies. <br><br> I communicated appropriately with partners in my project as I conducted an interview with an expert to achieve the right impact and execution. Therefore, Learning Outcome 6: Targeted Interaction applies.",
		"IctReasearchMethod": {
			"Label": "Expert Interview",
			"Url": "https://ictresearchmethods.nl/library/expert-interview/"
		},
		"images": false
	},
	"frontendframeworkcomparison": {
		"name": "Front-end Framework Comparison",
		"summary": "The tool will be built in a web environment and therefore, a front-end framework will be implemented. I conducted research on which front-end framework fits best for my project. TDE uses Svelte as their standard front-end framework, but in the ThreeJS course, I learned that React has a special front-end framework for ThreeJS called React-Three-Fiber. Later I found that Threlte is a similar framework that’s built upon SvelteKit. However, using Threlte makes it almost impossible to implement YukaJS, but it’s almost certain that YukaJS won’t be used anyway. <br><br> I conducted an open expert interview to discuss my findings on which front-end framework to use. Expert John was able to tell that Threlte can also be used as a module within Svelte and not as a standalone framework based on SvelteKit. John also opted to implement the tool in the RN365 repository right away and not to make a separate MVP. This also makes it impossible to use SvelteKit as RN365 uses custom routing that’s incompatible with the pre-baked routing built into SvelteKit. Therefore, we came to the conclusion to build the tool directly into the RN365 repository, and therefore use Svelte with Threlte as a module.",
		"imageUrl": "/img/frontendframeworkcomparison.png",
		"documentUrl": "https://docs.google.com/document/d/1r-3s6VcfqnPYETKr_iLaPyvgcSu0fOFpygetcF9ni7A/edit?usp=sharing",
		"date": "06-11-2023",
		"research": "Library Research",
		"phase": "Development",
		"learningOutcomes": [1, 2, 4, 6],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activities of Analysis and Advise as I analyzed what is the best front-end framework to use for the tool and advised what front-end framework to use and how the tool will be built. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> By deciding to build my tool directly into the RN365 repository and therefore using Svelte as front-end framework, I adapt to the processes and way of working of the company as TDE uses Svelte as their standard front-end framework. This deliverable is also relevant and valuable for one or more persons and creates value as I now know how to build the tool in the development phase. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> I identified a problem, which is that I didn’t know what front-end framework to use for the development of my tool and I found an effective approach and arrived at appropriate solutions by using a variety of research strategies, methods and activities as I conducted an expert interview to come to a conclusion on which front-end framework to use. Therefore, Learning Outcome 4: Investigative Problem Solving applies. <br><br> I collaborated appropriately with expert John, a partner in my project to achieve the desired impact. Therefore, Learning Outcome 6: Targeted Interaction applies.",
		"IctReasearchMethod": {
			"Label": "Expert Interview",
			"Url": "https://ictresearchmethods.nl/library/expert-interview/"
		},
		"images": false
	},
	"softwareandserverarchitecture": {
		"name": "Software and Server Architecture",
		"summary": "In the feasibility study, I discovered that potentially terabytes worth of data have to be processed during a racing event and concluded that some extra research needs to be conducted to define how the backend will support such large amounts of data. In an open expert interview with Jordi, I found that two types of servers will be used to host the backend of the tool. An EC2 server that continuously processes data from the FIA API and a few smaller Lambda servers to handle smaller tasks. This setup was chosen because the Lambda servers handle scalability all by themself, so they automatically scale up when demand is high. This is important as the tool will only be used during racing events. Lambda servers are also billed by usage, which saves costs when no races are held and demand is low. This setup was visualized in an IT architecture diagram.",
		"imageUrl": "/img/softwareandserverarchitecture.png",
		"documentUrl": "https://docs.google.com/document/d/1qDXR4tcZwgUPsacFMy4hPADJpD9wXjLG3pr6oSrLHyc/edit?usp=sharing",
		"date": "14-11-2023",
		"research": "Library Research",
		"phase": "Development",
		"learningOutcomes": [1, 2, 3, 4, 6],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activities of Analyze, Advise, and Design as I analyzed what the architecture of the backend should look like, advised on what servers to use and designed an IT architecture diagram to visualize my findings. This is in line with IT-area User Interaction. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> My work is relevant for one or more persons and creates value as I now know how to code the backend scripts. I also worked in a methodological and structured way in a context where approach and solution areas are open, with multiple stakeholders and multiple IT areas combined as I methodologically interviewed an expert in backend development and DevOps. Therefore, Learning Outcome 2: Situation-Orientation applies. <br><br> I took sustainability, business and money into consideration as I designed an IT architecture that saves money when demand is low. Also the Lambda server scale automatically, so the backend will never fail as a result of high demand. Therefore, Learning Outcome 3: Future-Oriented Organisation applies. <br><br> I identified a problem, which is the potential risk of a failing backend as a result of high demand, found an effective approach and came to an appropriate solution by using a variety of research strategies, methods and activities as I interviewed an expert on backend development and DevOps and visualized my findings in an IT architecture diagram. Therefore, Learning Outcome 4: Investigative Problem Solving applies. <br><br> I communicated appropriately to achieve the desired impact by interviewing an expert on backend development and DevOps. Therefore, Learning Outcome 6: Targeted Interaction applies.",
		"IctReasearchMethod": {
			"Label": "Expert Interview",
			"Url": "https://ictresearchmethods.nl/library/expert-interview/"
		},
		"images": false
	},
	"teamjumbovismarebrand": {
		"name": "Team Jumbo-Visma Rebrand",
		"summary": "A little while ago, TDE asked if I could assist with a little side project for a few days. This was a project for Team Jumbo-Visma. The sports team is going through a rebrand since Jumbo Supermarkten pulled the plug from their sponsorship. This resulted in a new brand around the sports team and the new corporate branding has to be implemented in their website. <br><br> Since their website has a similar setup as RN365, this was a great opportunity to prepare for the development of the new liveblog on the RN365 website. In this document you’ll read about my activities in this project, what I learned and how it helped me in my own project for RN365. <br><br> Thanks to my activities in this project, I was able to help TDE and get to know their way of working on a project. The time I spent on this project was also valuable for my own project as it was a refresh for me on TWIG, WSL and SCSS.",
		"imageUrl": "/img/tjvrebrand.png",
		"documentUrl": "https://docs.google.com/document/d/1Sl142wvyHTiuxybCqOKfxz2qCTnFwvM3D2oCCSpdGP0/edit?usp=sharing",
		"date": "8-12-2023",
		"research": "Not applicable",
		"phase": "Development",
		"learningOutcomes": [2],
		"LearningOutcomeClarification": "For this deliverable, I adapted to the processes and way of thinking of the company as I was able to work on a project that was setup with Macbooks with a Windows laptop. My work was also relevant and valuable as I helped TDE with their project, and it was valuable for me as it was a refresh on different techniques that will be used in my own project. Therefore, Learning Outcome 2: Situation-Orientation applies.",
		"IctReasearchMethod": {
			"Label": "Expert Interview",
			"Url": false
		},
		"images": [
			{
				"Url": "/img/tjvcalendar.png",
				"Caption": "New Team Jumbo-Visma Calendar"
			},
			{
				"Url": "/img/tjvpartners.png",
				"Caption": "New Team Jumbo-Visma Partners"
			}
		]
	},
	"backenddevelopment": {
		"name": "Backend Development",
		"summary": "I built a backend script that will process the eventstream from the undocumented API, detects events and logs them in the console. During the development of the front-end, the websocket logic will be implemented to send the events from the backend script to the front-end. This script will run on the EC2 server as defined during the interview with DevOps expert Jordi. For now, the script logs the time of the event, in what lap the event happened, and the text for the liveblog message, as this is the information that I’ll need for the front-end.",
		"imageUrl": "/img/backenddevelopment.png",
		"documentUrl": "https://docs.google.com/document/d/1FCkuWdwSmeCBO1BhdNN9kexEKbBiBPLDoSNs18JFVts/edit?usp=sharing",
		"date": "8-12-2023",
		"research": "Not applicable",
		"phase": "Development",
		"learningOutcomes": [1, 4],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activity of Realize, as I realized a backend script for the new liveblog that I’m going to build. It is also a professional product as a result of a professional duty as I interviewed an expert before building my backend script and built the script for the EC2 server as discussed during this interview. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> For this deliverable, I used results from research to create valuable solutions as I interviewed an expert to know how to build the backend script for the new liveblog. Therefore, Learning Outcome 4: Investigative Problem Solving applies.",
		"IctReasearchMethod": {
			"Label": "Expert Interview",
			"Url": false
		},
		"images": false
	},
	"dataanalytics": {
		"name": "Data Analytics",
		"summary": "For the Vegas GP, I recorded all data from the Formula 1 API and made a screen recording from the live broadcast. This way, I am able to tell which data belongs to which moment in the race and therefore, I can do some data analytics to find out what the variables in the data actually mean. <br><br> Because of the screen recording I was also able to determine a delay between the data source and the live broadcast. This delay turns out to be around 25 seconds. I have also been able to determine how to detect potential crashes, pit stops and tyre changes, overtakes and how to match the racing numbers in the API with the full names of the drivers.",
		"imageUrl": "/img/dataanalytics.png",
		"documentUrl": "https://docs.google.com/document/d/1-AKqcGuO-JB4ZTjVzuk-YgOzA1aDlxqjGw2pFd-hAFI/edit?usp=sharing",
		"date": "20-11-2023",
		"research": "Lab Research",
		"phase": "Development",
		"learningOutcomes": [1, 4],
		"LearningOutcomeClarification": "This deliverable is a professional duty on a bachelor level in the activity of Analysis as I analyzed the data from the data source and concluded on what data the data actually means and what data can be used to detect events happening during the race. Therefore, Learning Outcome 1: Professional Duties applies. <br><br> I used “Data analysis” as a research method from ictresearchmethods.nl for this deliverable. Therefore, Learning Outcome 4: Investigative Problem Solving applies.",
		"IctReasearchMethod": {
			"Label": "Data analytics",
			"Url": "https://ictresearchmethods.nl/lab/data-analytics/"
		},
		"images": false
	},
	"devtalkweyweyweb": {
		"name": "DevTalk WeyWeyWeb",
		"summary": "This year, I attended the WeyWeyWeb UX and UI conference in Malaga on behalf of my internship company, TDE. I had my personal reasons to be in Malaga at the time of the event and I knew that WeyWeyWeb would be an interesting event to gain some interesting knowledge related to my IT field. Therefore, I asked TDE if I could attend the conference and bring some valuable knowledge home to share with the rest of the team at my internship company. <br><br> TDE regularly organises a DevTalk meeting to discuss and share interesting topics and knowledge with the team. So therefore, a DevTalk would be the perfect moment to share my insights from WeyWeyWeb. This DevTalk is held on monday 10-12 and I prepared a presentation to share my experiences with the team. The slides are in the documentation.",
		"imageUrl": "/img/weyweyweb.png",
		"documentUrl": "/docs/devtalk.pdf",
		"date": "09-12-2023",
		"research": "Not applicable",
		"phase": "Not applicable",
		"learningOutcomes": [5, 6],
		"LearningOutcomeClarification": "I attended WeyWeyWeb because I pay attention to your own learning ability and keep in mind what kind of IT professional and/or what type of positions you aspire to. As I attended WeyWeyWeb, I gained valuable knowledge that will help me in my IT area. Therefore,Learning Outcome 5: Personal Leadership applies. <br><br> I presented my insights from WeyWeyWeb to the team. Therefore, Learning Outcome 6: Targeted Interaction applies.",
		"IctReasearchMethod": {
			"Label": "Expert Interview",
			"Url": false
		},
		"images": [
			{
				"Url": "/img/weyweyweb.jpg",
				"Caption": "WeyWeyWeb"
			},
			{
				"Url": "/img/weyweywebme.jpg",
				"Caption": "Jordi at WeyWeyWeb"
			}
		]
	},
	"meetingsummariesandfeedback": {
		"name": "Meeting Summaries and Feedback",
		"summary": "This document embraces an overview of every meeting or feedback moment I had this semester. This includes meetings like the updates with my company coach John and my semestercoach Erik, but also meetings related to the project like feedback from RacingNews365 and interviews with colleagues.",
		"imageUrl": "/img/meetingsummariesandfeedback.png",
		"documentUrl": "https://docs.google.com/document/d/16k5Nhf6Q4CVznBXBei4AeU1W4ZbJowuFKHnnK5NjLq4/edit?usp=sharing",
		"date": "05-09-2023",
		"research": "Not applicable",
		"phase": "Entire project",
		"learningOutcomes": [5, 6],
		"LearningOutcomeClarification": "Learning Outcome 5 applies for this deliverable as I took the lead in my own project planning wise as I independently planned every meeting with stakeholder RN365. This deliverable also proves that I can ask and receive feedback on my own actions.<br><br>Learning Outcome 6 applies for this deliverable as I communicated appropriately with the stakeholders in my project to ensure the right impact and execution.",
		"IctReasearchMethod": {
			"Label": "Expert Interview",
			"Url": false
		},
		"images": false
	},
	"gitcodemanagement": {
		"name": "Git Code Management",
		"summary": "I used Git as code management for the deliverables I’ve been working on during my internship. I haven’t used Git for all my code related deliverables. The Yuka.js POC’s were relatively small and these deliverables were only used to validate if something would work. They are not used during the build of the project itself. I also used Git to synchronize my work across my laptop for working at the office, and my desktop pc when working from home. <br><br> Git Fork is still my favorite Git client. Although I wasn’t able to use it in WSL for projects from TDE itself. Instead I used the Git CLI and the Git functionality in VSCode. I also used Git for continuous deployment from Github in Netlify where I host my portfolio. Next, I used Git for the development API to keep track of constant modifications. I collaborated with other colleagues in Git in the Team Jumbo-Visma rebrand side project, and of course I used Git for the build of my own project in the RN365 repository. I initially made a mistake by downloading a zip file from the repository and made it almost impossible to add a remote repository to the changes I had already made. But with some tips from John I was able to still add my project to a completely separate branch in the RN365 repository in TDE’s Gitlab.",
		"imageUrl": "/img/gitcodemanagement.png",
		"documentUrl": "https://docs.google.com/document/d/1h4Ku4v3wT-p3lJl8Qv3SiHTu5YyXevTDf_tbmEzgY7k/edit?usp=sharing",
		"date": "20-12-2023",
		"research": "Not applicable",
		"phase": "Entire project",
		"learningOutcomes": [1, 2, 6],
		"LearningOutcomeClarification": "Learning outcome 1 applies to this deliverable because this is a professional duty on a bachelor level in the activity of Manage&Control and is in line with the IT area User Interaction. <br><br> Learning outcome 2 applies to this deliverable because I applied previously acquired knowledge about Git and adapted to the processes and way of working of the company. <br><br> Learning outcome 6 applies to this deliverable because I collaborated with colleagues in Git to work on the Team Jumbo-Visma side project.",
		"IctReasearchMethod": {
			"Label": "Expert Interview",
			"Url": false
		},
		"images": false
	},
	"reflectionconceptphase": {
		"name": "Reflection Conceptphase",
		"summary": "This semester, I decided to try a different approach to reflecting. I used to use the Four-L reflection method about every two weeks during previous semesters. I found that this is way too frequent, and that I often struggled to come up with genuine points to write down. Therefore, I reflected once per project phase on specific topics that I consider important for a reflection. These are activities and milestones, achievements, challenges and learning, feedback and interactions, skills and tools used, emotional and personal reflection and improvements for the rest of my internship. <br><br> The conclusion I get from this reflection is that there’s plenty to improve on focus and productivity. There are factors that made me struggle a bit with this topic, but I have a plan to improve on this.",
		"imageUrl": "/img/reflectionconceptphase.png",
		"documentUrl": "https://docs.google.com/document/d/1niVQx3_Am7-FS9v4Pw8KehMuAxkhv7KedDTzIaQMv9Q/edit?usp=sharing",
		"date": "18-10-2023",
		"research": "Not applicable",
		"phase": "Entire project",
		"learningOutcomes": [5],
		"LearningOutcomeClarification": "Learning outcome 5 applies for this deliverable as I showed that I can reflect on my own actions.",
		"IctReasearchMethod": {
			"Label": "Expert Interview",
			"Url": false
		},
		"images": false
	},
	"returnday": {
		"name": "Returnday",
		"summary": "Half way during the semester there was an opportunity to present the project and get some feedback on progression. In the documentation you’ll find the slides I made for the presentation. The feedback from this day is included in the “Meeting Summaries and Feedback” deliverable.",
		"imageUrl": "/img/returnday.png",
		"documentUrl": "/docs/returnday.pdf",
		"date": "27-11-2023",
		"research": "Not applicable",
		"phase": "Entire project",
		"learningOutcomes": [5],
		"LearningOutcomeClarification": "Learning outcome 5 applies for this deliverable as I showed that I can receive feedback on my actions.",
		"IctReasearchMethod": {
			"Label": "Expert Interview",
			"Url": false
		},
		"images": false
	},
	"developingtheimprovedliveblog": {
		"name": "Developing the Improved Liveblog",
		"summary": "I assumed developing the improved liveblog would be the most difficult and time consuming stage of the project as a combination of technologies and coding languages make the project fairly complex. Fortunately, development ran smoothly and I was finished before I knew it. <br><br> My plan was to simply start developing and see how easy it goes. This way I assumed it would be easier to estimate a backlog for a scrum board. However, before I knew, I was already halfway finished. Because of the complexity and straight forward goal of the project, I decided to use the Ad Hoc method instead. <br><br> I ended up with a modified page of the CMS that receives the event detected by the backend. The editor has a variety of text options to choose from ranging from least exuberant to most exuberant. The editor can add an item straight to the liveblog, or edit it if necessary. A countdown clock is added so the editor can time the posting of a liveblog item to deliver a truly live experience for the liveblog user. <br><br> I visited RN365 for some feedback on the things I made. Both Jan and Jesse were very pleased with the liveblog as it is. The most important thing I wanted to know was if the automation was right. Jan indicated that an edit button and an add button is exactly how he would want it. We also discussed 3D visualization. This feedback will be applied in a different phase of development. In a different feedback moment, it was discussed to change the emoji buttons with a slider. I applied this feedback.",
		"imageUrl": "/img/developingtheimprovedliveblog.png",
		"documentUrl": "https://docs.google.com/document/d/1cV75CnoO-Dfc4RWAVfmMG0q3g9Oa_XTVk3-yW8rRiK0/edit?usp=sharing",
		"date": "22-12-2023",
		"research": "Not applicable",
		"phase": "Development",
		"learningOutcomes": [1, 2, 6],
		"LearningOutcomeClarification": "Learning outcome 1 applies to this deliverable as this is a professional duty on a bachelor level in the activity of Realize and Manage&Control, as I realized the newly improved liveblog in the shape of an MVP and used the Ad Hoc method to manage the tasks in this stage of the project. <br><br> Learning outcome 2 applies to this deliverable as I used multiple technologies and coding languages that TDE uses to develop their projects. Therefore, I adapted to the processes and way of thinking of the company. My work is also relevant and valuable as this is the core business of my project. I also worked in a methodological and structured way, as I used the Ad Hoc management method to manage tasks in the development process. <br><br> Learning outcome 6 applies to this deliverable as I communicated appropriately with colleagues and got help with tasks I couldn't complete on my own.",
		"IctReasearchMethod": {
			"Label": "Expert Interview",
			"Url": false
		},
		"images": [
			{
				"Url": "/img/liveblog.png",
				"Caption": "Improved the CMS of the liveblog page."
			},
			{
				"Url": "/img/rnfeedback.png",
				"Caption": "Applied feedback and changed the buttons to slider."
			}
		]
	},
	"advancedpersuasivecommunicationtechniques": {
		"name": "Advanced Persuasive Communication Techniques",
		"summary": "Persuasive Communication Techniques are a nifty set of skills to influence an audience on an opinion. By structuring a presentation according to the rhetorical triangle and taking the opinion of the audience in mind, I can increase the credibility of my work. This way, I hope to do a distinctly lucid presentation to shift the opinions of the jury and the audience according to my liking.",
		"imageUrl": "/img/advancedpersuasivecommunicationtechniques.png",
		"documentUrl": "https://docs.google.com/document/d/1WW9Mut4PmA317CWWYNuJXoMF94PhJktSNNdmO5ZvRgU/edit?usp=sharing",
		"date": "27-12-2023",
		"research": "Deskresearch",
		"phase": "Personal Development",
		"learningOutcomes": [5, 6],
		"LearningOutcomeClarification": "Learning outcome 5 applies to this deliverable as I paid attention to my learning ability and am aware of what I want to learn for the role that I envision in the IT-landscape. <br><br> Learning outcome 6 applies for this deliverable as I communicated appropriately to achieve the desired impact. I want to persuade the audience and jury during my graduation session and I will apply advanced persuasive communication techniques to appropriately achieve this.",
		"IctReasearchMethod": {
			"Label": "Literature study",
			"Url": "https://ictresearchmethods.nl/library/literature-study/"
		},
		"images": [
			{
				"Url": "/img/therethoricaltriangle.png",
				"Caption": "The rethorical triangle."
			}
		]
	},
	"workingwithaiinaproject": {
		"name": "Working with AI in a Project",
		"summary": "I started working with AI this semester, primarily with ChatGPT. ChatGPT has had a tremendous effect on my productivity and allowed me to build the new liveblog as I have designed it in the concepting phase. <br><br> In this document, I explained how I used ChatGPT as a search engine, for feedback on my work, when I don’t know an approach for things and for code related assistance. I also included how I made custom GPTs to summarize my documentation for assessment and that I made a GPT to assist me with the production of two videos that I’m planning to make for my presentation at my graduation conference. I also included my ethical opinion of the use of AI as a coding assistant.",
		"imageUrl": "/img/workingwithaiinaproject.png",
		"documentUrl": "https://docs.google.com/document/d/1ZRJ-6v8Jxvcq3q2pZ5esA7oNtBCyoak7uucfzTMz1So/edit?usp=sharing",
		"date": "27-12-2023",
		"research": "Not applicable",
		"phase": "Personal Development",
		"learningOutcomes": [3, 5],
		"LearningOutcomeClarification": "Learning outcome 5 applies to this deliverable as I wanted to learn to use AI to speed up my workflow this semester. Therefore, I paid attention to your own learning ability. <br><br> Learning outcome 3 applies to this deliverable as I considered ethical perspectives of the use of AI in projects.",
		"IctReasearchMethod": {
			"Label": "Literature study",
			"Url": false
		},
		"images": false
	},
	"codeimprovementsandfeedback": {
		"name": "Code Improvements and Feedback",
		"summary": "I’m always keen to improve my coding skills. Therefore, I asked John to have a look at my commits in Gitlab. John gave feedback on some specific things in my code and later we discussed some general improvements and good habits. <br><br> John didn’t find any major faults in my code. I should use more template literals, do more checks to prevent errors and potentially define more variables, just in case a color needs to be changed, it needs only to be changed in one place. <br><br> In general I could pay more attention to code structure. Things like defining variables and functions in one place would make code more readable. This also applies to avoiding large chunks of code.",
		"imageUrl": "/img/codeimprovementsandfeedback.png",
		"documentUrl": "https://docs.google.com/document/d/1SNjX0nxwXkJ-2NNpC2HK_tpX3EhUq4T5AH0kAgF_rME/edit?usp=sharing",
		"date": "09-01-2024",
		"research": "Not applicable",
		"phase": "Personal Development",
		"learningOutcomes": [5],
		"LearningOutcomeClarification": "Learning outcome 5 applies for this deliverable as I pay close attention to my own learning ability and I received feedback on my work.",
		"IctReasearchMethod": {
			"Label": "Literature study",
			"Url": false
		},
		"images": false
	},
	"projectethicsandsustainability": {
		"name": "Project Ethics and Sustainability",
		"summary": "In the concepting phase, we decided to use the livetiming API from Formula 1 as a data source. RN365 already uses this data source for its live timing stats. However, there are some ethical and sustainable considerations to keep in mind. <br><br> During the project, I spoke to several people to get their opinion of the use of the Formula 1 API. Based on these talks, I was able to shape my own ethical opinion on the issue and also consider the sustainable impact in case this data source would suddenly become unavailable. <br><br> The way the data source is used doesn’t provide any major sustainability or ethical risks. This is because the liveblog will still function like it’s used to function if the data isn’t available. Next, the data from the data source isn't used to directly make money off it. It only makes the process of keeping the liveblog up to date more easy for the editorial of RN365. And the data that is shared, is widely available on the internet anyway. Add this to the fact that Formula 1 has a responsibility in securing their data if they don’t want others using it, doesn’t make me think that using the data source is ethically wrong for the project. And by only sharing data that’s widely available, I don’t expect RN365 to run into any legal issues.",
		"imageUrl": "/img/projectethicsandsustainability.png",
		"documentUrl": "https://docs.google.com/document/d/1XwU2pPXw59ijWzwmRMzGs6O6u74va09cMHvzmA79kNI/edit?usp=sharing",
		"date": "09-01-2024",
		"research": "Not applicable",
		"phase": "Orientation and Concepting",
		"learningOutcomes": [3],
		"LearningOutcomeClarification": "Learning outcome 3 applies for this deliverable as I considered ethical and sustainable aspects of the project.",
		"IctReasearchMethod": {
			"Label": "Literature study",
			"Url": false
		},
		"images": false
	},
	"progressupdates": {
		"name": "Progress Updates",
		"summary": "Considering the fact that I only had about 15 minutes for every progress update with my semestercoach Erik. I decided to present my progress in a slideshow if I had a lot to discuss. I did this to keep things organised and to make sure I didn’t forget anything in those 15 minutes. Only the slides of these slideshows are in the documentation. Summaries of what was discussed and the feedback I received are in the <a href='https://s8-graduation.jordifranssen.com/deliverables/meetingsummariesandfeedback'>Meeting Summaries and Feedback</a> deliverable.",
		"imageUrl": "/img/progressupdates.png",
		"documentUrl": "/docs/progressupdates.pdf",
		"date": "09-01-2024",
		"research": "Not applicable",
		"phase": "Presentations and Meetings",
		"learningOutcomes": [6],
		"LearningOutcomeClarification": "Learning outcome 6 applies to this deliverable as I communicated appropriately to ensure the right impact and execution during the progress updates with my semestercoach.",
		"IctReasearchMethod": {
			"Label": "Literature study",
			"Url": false
		},
		"images": false
	},
	"developingthepositionvisualization": {
		"name": "Developing the Position Visualization",
		"summary": "In a feedback meeting with RN365, it was discussed that the positions of the events happening during a race will not be visualized in 3D, but simply in an image. This is because 3D doesn’t provide any more context to the user and building it is quite complex.<br><br> To make the shape, we have to take the scale and position of the track into account. We discussed an approach and decided to make a separate tool that uses the location data in the data source to generate the shape of the track. This way the scale of the shape will always match with the data in the data source.<br><br> I started looping through the available data in the static API. This way a file can be selected that will be downloaded by the server. The logic for reading the file line by line, decrypting the content and sending it over to the client was taken from the PoC that I made earlier. <br><br> This works but I still found some challenges in cropping the canvas and I will deliver this tool as a PoC for generating the shapes instead of including it in the MVP with the liveblog.",
		"imageUrl": "/img/developingthepositionvisualization.png",
		"documentUrl": "https://docs.google.com/document/d/1vntXx-a2cMyZ3KRKxCZd7m0KngnY62w4ThEzgSZGKBw/edit?usp=sharing",
		"date": "02-01-2024",
		"research": "Not applicable",
		"phase": "Development",
		"learningOutcomes": [1],
		"LearningOutcomeClarification": "Learning outcome 1 applies for this deliverable as this is a professional duty on a bachelor level in the activity of realization as I realized a POC for generating the shape of a racetrack.",
		"IctReasearchMethod": {
			"Label": "Literature study",
			"Url": false
		},
		"images": [
			{
				"Url": "/img/trackshapetool.png",
				"Caption": "Tool for generating the shape."
			},
			{
				"Url": "/img/upsidedownpig.png",
				"Caption": "VegasGP not in the middle."
			},
			{
				"Url": "/img/dutchgp.png",
				"Caption": "Border-radius too large for DutchGP."
			}
		]
	},
	"adviceforfurtherdevelopment": {
		"name": "Advice for Further Development",
		"summary": "This document contains the advice for further development of the project. It can also be seen as a transfer document for the project. In this document, I explained the project overview including the project assignment, the different project phases and what has been delivered at the end. Next I explain how the MVP should be started and how it runs with the development API and with the API when using live data. At last I explained how the MVP should be developed into a final product that’s ready for production. Location visualization, the CMS layout, event detection and text suggestions can be improved. Features like grouping events could be added. And the server architecture should be simplified. It would be ideal if the final product could be tested during the pre-season test, and launched before the first race of the season.",
		"imageUrl": "/img/adviceforfurtherdevelopment.png",
		"documentUrl": "https://docs.google.com/document/d/1SNBy2FyO-ZORo2eHMMysvzUfOxwaXsxyw1U4EVHwM7s/edit?usp=sharing",
		"date": "10-01-2024",
		"research": "Not applicable",
		"phase": "Entire project",
		"learningOutcomes": [1, 3, 6],
		"LearningOutcomeClarification": "Learning outcome 1 applies to this deliverable as I advised on the development of the project. <br><br> Learning outcome 3 applies to this deliverable as I advised on the future of this project. <br><br> Learning outcome 6 applies to this deliverable as this deliverable is written for colleagues who will continue this project. Therefore, I communicated appropriately to ensure the desired impact.",
		"IctReasearchMethod": {
			"Label": "Literature study",
			"Url": false
		},
		"images": false
	},
	"designanddevelopmentreflection": {
		"name": "Design and Development Reflection",
		"summary": "In my last reflection moment, I used a new approach. In this reflection I used the same topics again because I prefer this way of reflecting. In the last few weeks I elaborated my project into a working MVP. I call this an achievement. Next to the success of my own project, I have also been busy with some side activities. I attended the WayWayWeb conference in Malaga, and reported the things I learned back to the team. I also worked on a client project for TDE. This was also helpful for my own project as this project was set up in a similar way as RN365. <br><br> The more personal part of my reflection is a major improvement over the last reflection. In my last reflection I reflected on how I struggled to adapt to working from home. I’m still most productive at the office, but I learned what activities I can better avoid doing at home, like documenting for my portfolio, to keep my productivity at home up. I can also say that I’m completely over my post travel blues and I believe that this also fixed my struggles with achieving good sleep.",
		"imageUrl": "/img/designanddevelopmentreflection.png",
		"documentUrl": "https://docs.google.com/document/d/1DbnLgD8UtZIFmolAxS_IF_KFB3lB5mxmRnVkXrwCXGY/edit?usp=sharing",
		"date": "12-01-2024",
		"research": "Not applicable",
		"phase": "Entire project",
		"learningOutcomes": [5],
		"LearningOutcomeClarification": "Learning outcome 5 applies for this deliverable as I showed that I can reflect on my own actions.",
		"IctReasearchMethod": {
			"Label": "Literature study",
			"Url": false
		},
		"images": false
	}
}
